NextFOAM-2405/tutorials/incompressible/pisoFoam/RAS/cavity/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh

restore0Dir

runApplication decomposePar

runParallel topoSet

runParallel $(getApplication)

runApplication reconstructPar


latestTime=$(foamListTimes -latestTime)

mv -f "$latestTime" "$latestTime".bak

mkdir procs.old

mv -f processor* procs.old

runParallel -s "decompose" redistributePar -decompose -time 9.5

runParallel -s 2 $(getApplication)

runParallel -s "reconstruct" redistributePar -reconstruct -latestTime

#------------------------------------------------------------------------------
